In [1]:
import numpy as np
import pandas as pd

In [2]:
vals1 = np.array([1, None, 2, 3])
vals1

array([1, None, 2, 3], dtype=object)

In [3]:
%timeit np.arange(1E6, dtype=int).sum()

2.61 ms ± 134 μs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [4]:
%timeit np.arange(1E6, dtype=object).sum()

70.1 ms ± 886 μs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [5]:
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [6]:
vals2 = np.array([1, np.nan, 2, 3])
vals2

array([ 1., nan,  2.,  3.])

In [7]:
1 + np.nan

nan

In [8]:
0 * np.nan

nan

In [9]:
vals2.sum(), vals2.min(), vals2.max()

(np.float64(nan), np.float64(nan), np.float64(nan))

In [10]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(np.float64(6.0), np.float64(1.0), np.float64(3.0))

In [11]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [12]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int64

In [15]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

In [20]:
X = pd.Series([True, None, False, True])
X

0     True
1     None
2    False
3     True
dtype: object

In [22]:
a = pd.Series([1, np.nan, 2, None, pd.NA], dtype='Int32')
a

0       1
1    <NA>
2       2
3    <NA>
4    <NA>
dtype: Int32

In [34]:
data = pd.Series([1, np.nan, 'hello', None])

In [35]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [32]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [37]:
data.dropna()

0        1
2    hello
dtype: object

In [44]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [50]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [51]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [52]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [53]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [59]:
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [64]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'), dtype='Int32')
data

a       1
b    <NA>
c       2
d    <NA>
e       3
dtype: Int32

In [65]:
data.fillna(0)

a    1
b    0
c    2
d    0
e    3
dtype: Int32

In [67]:
data.ffill()

a    1
b    1
c    2
d    2
e    3
dtype: Int32

In [68]:
data.bfill()

a    1
b    2
c    2
d    3
e    3
dtype: Int32

In [69]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [70]:
df.ffill(axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0